angular.module('riskApp').factory('counterMeasures', function () {
	return [
	"попереднє навчання членів проектного колективу",
	"узгодження детального переліку вимог із замовником",
	"включення узгодженого списку вимог замовника в договір",
	"точне слідування вимогам замовника з узгодженого списку вимог",
	"попередні дослідження ринку",
	"експертна оцінка проекту досвідченим стороннім консультантом",
	"консультації досвідченого стороннього консультанта",
	"тренінг з вивчення необхідних інструментів розроблення",
	"укладання договору страхування",
	"використання «шаблонних» рішень з вдалих попередніх проектів при управлінні проектом",
	"підготовка документів, які показують важливість даного проекту для досягнення фінансових цілей компанії-розробника",
	"реорганізація роботи проектного колективу таким чином, щоб обов’язки та робота членів колективу перекривали один одного",
	"придбання (замовлення) частини компонентів розроблюваного ПЗ; 14ev -заміна потенційно дефектних компонентів розроблюваного ПЗ придбаними компонентами, які гарантують якість роботи",
	"придбання більш продуктивної бази даних",
	"використання генератора програмного коду",
	"реорганізація роботи проектного колективу в залежності від рівня складності задач та професійних рівнів розробників",
	"повторне використання підходящих компонентів ПЗ, які були розроблені для інших проектів",
	"аналіз доцільності створення даного ПЗ."

	];

})